
## Terrafom Analysis ⚙️

| Format & Style               | Init                          | Validation                        | Plan                          |
| ---------------------------- | ----------------------------- | --------------------------------- | ----------------------------- |
| `success` | `success` | `success` | `success` |

### Validation details:
<details><summary>Output</summary>

```

Success! The configuration is valid.


```

</details>

### Plan details:
<details><summary>Output</summary>

```

Plan results: 
module.linux_host.data.azurerm_resource_group.resource_group[0]: Reading...
module.windows_host.data.azurerm_resource_group.resource_group[0]: Reading...
module.windows_host.data.azurerm_resource_group.resource_group[0]: Read complete after 0s [id=/subscriptions/daa199cb-dc7b-44a9-b13a-12b0bda23058/resourceGroups/test-rg]
module.windows_host.module.network_interfaces["nic-0"].data.azurerm_resource_group.vnet_rg: Reading...
module.linux_host.data.azurerm_resource_group.resource_group[0]: Read complete after 0s [id=/subscriptions/daa199cb-dc7b-44a9-b13a-12b0bda23058/resourceGroups/test-rg]
module.windows_host.module.network_interfaces["nic-1"].data.azurerm_resource_group.vnet_rg: Reading...
module.linux_host.module.network_interfaces["nic-1"].data.azurerm_resource_group.vnet_rg: Reading...
module.linux_host.module.network_interfaces["nic-0"].data.azurerm_resource_group.vnet_rg: Reading...
module.windows_host.module.network_interfaces["nic-0"].data.azurerm_resource_group.vnet_rg: Read complete after 0s [id=/subscriptions/daa199cb-dc7b-44a9-b13a-12b0bda23058/resourceGroups/test-rg]
module.linux_host.module.network_interfaces["nic-0"].data.azurerm_resource_group.vnet_rg: Read complete after 0s [id=/subscriptions/daa199cb-dc7b-44a9-b13a-12b0bda23058/resourceGroups/test-rg]
module.windows_host.module.network_interfaces["nic-1"].data.azurerm_resource_group.vnet_rg: Read complete after 0s [id=/subscriptions/daa199cb-dc7b-44a9-b13a-12b0bda23058/resourceGroups/test-rg]
module.linux_host.module.network_interfaces["nic-1"].data.azurerm_resource_group.vnet_rg: Read complete after 0s [id=/subscriptions/daa199cb-dc7b-44a9-b13a-12b0bda23058/resourceGroups/test-rg]
module.windows_host.module.network_interfaces["nic-1"].data.azurerm_virtual_network.vnet: Reading...
module.windows_host.module.network_interfaces["nic-0"].data.azurerm_virtual_network.vnet: Reading...
module.linux_host.module.network_interfaces["nic-0"].data.azurerm_virtual_network.vnet: Reading...
module.linux_host.module.network_interfaces["nic-1"].data.azurerm_virtual_network.vnet: Reading...
module.linux_host.module.network_interfaces["nic-1"].data.azurerm_virtual_network.vnet: Read complete after 0s [id=/subscriptions/daa199cb-dc7b-44a9-b13a-12b0bda23058/resourceGroups/test-rg/providers/Microsoft.Network/virtualNetworks/test-vnet]
module.windows_host.module.network_interfaces["nic-1"].data.azurerm_virtual_network.vnet: Read complete after 0s [id=/subscriptions/daa199cb-dc7b-44a9-b13a-12b0bda23058/resourceGroups/test-rg/providers/Microsoft.Network/virtualNetworks/test-vnet]
module.linux_host.module.network_interfaces["nic-0"].data.azurerm_virtual_network.vnet: Read complete after 0s [id=/subscriptions/daa199cb-dc7b-44a9-b13a-12b0bda23058/resourceGroups/test-rg/providers/Microsoft.Network/virtualNetworks/test-vnet]
module.linux_host.module.network_interfaces["nic-1"].data.azurerm_subnet.subnet: Reading...
module.linux_host.module.network_interfaces["nic-0"].data.azurerm_subnet.subnet: Reading...
module.windows_host.module.network_interfaces["nic-0"].data.azurerm_virtual_network.vnet: Read complete after 0s [id=/subscriptions/daa199cb-dc7b-44a9-b13a-12b0bda23058/resourceGroups/test-rg/providers/Microsoft.Network/virtualNetworks/test-vnet]
module.windows_host.module.network_interfaces["nic-1"].data.azurerm_subnet.subnet: Reading...
module.windows_host.module.network_interfaces["nic-0"].data.azurerm_subnet.subnet: Reading...
module.windows_host.module.network_interfaces["nic-0"].data.azurerm_subnet.subnet: Read complete after 0s [id=/subscriptions/daa199cb-dc7b-44a9-b13a-12b0bda23058/resourceGroups/test-rg/providers/Microsoft.Network/virtualNetworks/test-vnet/subnets/test-subnet]
module.windows_host.module.network_interfaces["nic-1"].data.azurerm_subnet.subnet: Read complete after 0s [id=/subscriptions/daa199cb-dc7b-44a9-b13a-12b0bda23058/resourceGroups/test-rg/providers/Microsoft.Network/virtualNetworks/test-vnet/subnets/test-subnet]
module.linux_host.module.network_interfaces["nic-1"].data.azurerm_subnet.subnet: Read complete after 0s [id=/subscriptions/daa199cb-dc7b-44a9-b13a-12b0bda23058/resourceGroups/test-rg/providers/Microsoft.Network/virtualNetworks/test-vnet/subnets/test-subnet]
module.linux_host.module.network_interfaces["nic-0"].data.azurerm_subnet.subnet: Read complete after 0s [id=/subscriptions/daa199cb-dc7b-44a9-b13a-12b0bda23058/resourceGroups/test-rg/providers/Microsoft.Network/virtualNetworks/test-vnet/subnets/test-subnet]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # random_password.windows_password will be created
  + resource "random_password" "windows_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # tls_private_key.linux_ssh_key will be created
  + resource "tls_private_key" "linux_ssh_key" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.linux_host.azurerm_linux_virtual_machine.virtual_machine[0] will be created
  + resource "azurerm_linux_virtual_machine" "virtual_machine" {
      + admin_username                  = "test-admin"
      + allow_extension_operations      = true
      + computer_name                   = "test-vm"
      + disable_password_authentication = true
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + license_type                    = "SLES_BYOS"
      + location                        = "eastus"
      + max_bid_price                   = -1
      + name                            = "test-vm"
      + network_interface_ids           = (known after apply)
      + patch_assessment_mode           = "ImageDefault"
      + patch_mode                      = "ImageDefault"
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "test-rg"
      + size                            = "Standard_F2"
      + tags                            = {
          + "test" = "test"
        }
      + virtual_machine_id              = (known after apply)
      + zone                            = "1"

      + admin_ssh_key {
          + public_key = (known after apply)
          + username   = "test-admin"
        }

      + os_disk {
          + caching                   = "None"
          + disk_size_gb              = 30
          + name                      = "test-vm-osdisk"
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "16.04-LTS"
          + version   = "latest"
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }
    }

  # module.windows_host.azurerm_windows_virtual_machine.virtual_machine[0] will be created
  + resource "azurerm_windows_virtual_machine" "virtual_machine" {
      + admin_password             = (sensitive value)
      + admin_username             = "test-admin"
      + allow_extension_operations = true
      + computer_name              = "test-vm"
      + enable_automatic_updates   = true
      + extensions_time_budget     = "PT1H30M"
      + hotpatching_enabled        = false
      + id                         = (known after apply)
      + license_type               = "Windows_Server"
      + location                   = "eastus"
      + max_bid_price              = -1
      + name                       = "test-vm"
      + network_interface_ids      = (known after apply)
      + patch_assessment_mode      = "ImageDefault"
      + patch_mode                 = "AutomaticByOS"
      + platform_fault_domain      = -1
      + priority                   = "Regular"
      + private_ip_address         = (known after apply)
      + private_ip_addresses       = (known after apply)
      + provision_vm_agent         = true
      + public_ip_address          = (known after apply)
      + public_ip_addresses        = (known after apply)
      + resource_group_name        = "test-rg"
      + size                       = "Standard_F2"
      + tags                       = {
          + "test" = "test"
        }
      + virtual_machine_id         = (known after apply)
      + zone                       = "1"

      + os_disk {
          + caching                   = "None"
          + disk_size_gb              = 60
          + name                      = "test-vm-osdisk"
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-Datacenter-smalldisk"
          + version   = "latest"
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }
    }

  # module.linux_host.module.network_interfaces["nic-0"].azurerm_network_interface.nic will be created
  + resource "azurerm_network_interface" "nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "eastus"
      + mac_address                   = (known after apply)
      + name                          = "nic-0"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "test-rg"
      + tags                          = {
          + "test" = "test"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig0"
          + primary                                            = true
          + private_ip_address                                 = "10.0.0.10"
          + private_ip_address_allocation                      = "Static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/daa199cb-dc7b-44a9-b13a-12b0bda23058/resourceGroups/test-rg/providers/Microsoft.Network/virtualNetworks/test-vnet/subnets/test-subnet"
        }
    }

  # module.linux_host.module.network_interfaces["nic-1"].azurerm_network_interface.nic will be created
  + resource "azurerm_network_interface" "nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "eastus"
      + mac_address                   = (known after apply)
      + name                          = "nic-1"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "test-rg"
      + tags                          = {
          + "test" = "test"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig0"
          + primary                                            = true
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/daa199cb-dc7b-44a9-b13a-12b0bda23058/resourceGroups/test-rg/providers/Microsoft.Network/virtualNetworks/test-vnet/subnets/test-subnet"
        }
    }

  # module.windows_host.module.data_disks["10"].data.azurerm_resource_group.resource_group[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "resource_group" {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "test-rg"
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.windows_host.module.data_disks["10"].azurerm_managed_disk.disk will be created
  + resource "azurerm_managed_disk" "disk" {
      + create_option                 = "Empty"
      + disk_iops_read_only           = (known after apply)
      + disk_iops_read_write          = (known after apply)
      + disk_mbps_read_only           = (known after apply)
      + disk_mbps_read_write          = (known after apply)
      + disk_size_gb                  = 10
      + id                            = (known after apply)
      + location                      = "eastus"
      + logical_sector_size           = (known after apply)
      + max_shares                    = (known after apply)
      + name                          = "test-vm-datadisk0"
      + public_network_access_enabled = true
      + resource_group_name           = "test-rg"
      + source_uri                    = (known after apply)
      + storage_account_type          = "Standard_LRS"
      + tags                          = {
          + "test" = "test"
        }
      + tier                          = (known after apply)
      + zone                          = "1"
    }

  # module.windows_host.module.data_disks["10"].azurerm_virtual_machine_data_disk_attachment.disk_attach[0] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "disk_attach" {
      + caching                   = "None"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 10
      + managed_disk_id           = (known after apply)
      + virtual_machine_id        = (known after apply)
      + write_accelerator_enabled = false
    }

  # module.windows_host.module.network_interfaces["nic-0"].azurerm_network_interface.nic will be created
  + resource "azurerm_network_interface" "nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "eastus"
      + mac_address                   = (known after apply)
      + name                          = "nic-0"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "test-rg"
      + tags                          = {
          + "test" = "test"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig0"
          + primary                                            = true
          + private_ip_address                                 = "10.0.0.10"
          + private_ip_address_allocation                      = "Static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/daa199cb-dc7b-44a9-b13a-12b0bda23058/resourceGroups/test-rg/providers/Microsoft.Network/virtualNetworks/test-vnet/subnets/test-subnet"
        }
    }

  # module.windows_host.module.network_interfaces["nic-1"].azurerm_network_interface.nic will be created
  + resource "azurerm_network_interface" "nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "eastus"
      + mac_address                   = (known after apply)
      + name                          = "nic-1"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "test-rg"
      + tags                          = {
          + "test" = "test"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig0"
          + primary                                            = true
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/daa199cb-dc7b-44a9-b13a-12b0bda23058/resourceGroups/test-rg/providers/Microsoft.Network/virtualNetworks/test-vnet/subnets/test-subnet"
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + output_1 = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

### Errors:
<details><summary>Output</summary>

```

Errors in plan: 

```

</details>

*Pusher: @shoootyou, Action: `pull_request`, Workflow: `Terraform Analysis`*